## Normalizacija
<h4>Kako funkcioni≈°e normalizacija?</h4>

**Normalizacija** je postupak skaliranja numeriƒçkih podataka tako da se njihove vrednosti dovedu na **uporediv opseg**, najƒçe≈°ƒáe [0, 1].

Cilj je da nijedna promenljiva ne dominira analizom ili modelom samo zato ≈°to ima veƒáe numeriƒçke vrednosti.

In [2]:
!mamba install pandas

mambajs 0.19.13

Specs: xeus-python, numpy, matplotlib, pillow, ipywidgets>=8.1.6, ipyleaflet, scipy, pandas
Channels: emscripten-forge, conda-forge

Solving environment...
Solving took 1.5999000000953674 seconds
  Name                          Version                       Build                         Channel
‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ
+ pandas                        3.0.0                         np22py313h9d9dc1e_0           emscripten-forge
+ python-tzdata                 2025.3                        pyhd8ed1ab_0                  conda-forge
- pip                           25.3                          pyh145f28c_0                  conda-forge

In [7]:
%pip install seaborn

mambajs 0.19.13

Process pip requirements ...

Requirement numpy already satisfied.
Requirement pandas already satisfied.
Requirement matplotlib already satisfied.
Successfully installed seaborn-0.13.2

In [8]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

## Min‚ÄìMax normalizacija
Formula:

$\Large x_{norm} = \frac{x - x_{min}}{x_{max} - x_{min}}$

Transformisemo vrednosti atributa iz prirodnog raspona [min, max], na **raspon [0, 1]**.

In [16]:
def minmax(X):
      return (X - min(X))/(max(X) - min(X))

In [9]:
titanic = sns.load_dataset("titanic")

In [10]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
# hocemo da odradimo skaliranje po koloni fare
titanic['fare'] = minmax(titanic['fare'])
titanic['fare']

0      0.014151
1      0.139136
2      0.015469
3      0.103644
4      0.015713
         ...
886    0.025374
887    0.058556
888    0.045771
889    0.058556
890    0.015127
Name: fare, Length: 891, dtype: float64

In [17]:
# prethodna definicija ne radi sa NaN vrednostima, sledeca radi: 

def minmax(X):
    return (X - X.min()) / (X.max() - X.min())

In [21]:
# ako mozda imamo neko polje da je ?, zelimo pre primene minmax da ga zamenimo sa NaN:
titanic.replace("?", np.nan, inplace=True)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,0.014151,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,0.139136,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,0.015469,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,0.103644,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,0.015713,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,0.025374,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,0.058556,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,0.045771,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,0.058556,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,0.015127,Q,Third,man,True,NaN,Queenstown,no,True

In [31]:
# sta ako treba da prmenimo tip podataka?
titanic['sibsp'] = titanic['sibsp'].astype('Float64')  #int,float,str,bool,category
titanic

#üëâ VEOMA BITNO:

# 'int' ‚ùå ne podr≈æava NaN

# 'Int64' ‚úÖ podr≈æava NaN

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1.0,0,0.014151,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1.0,0,0.139136,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0.0,0,0.015469,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1.0,0,0.103644,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0.0,0,0.015713,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0.0,0,0.025374,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0.0,0,0.058556,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1.0,2,0.045771,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0.0,0,0.058556,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0.0,0,0.015127,Q,Third,man,True,NaN,Queenstown,no,True

# Odsecanje

Ako podaci imaju **ekstremne autlajere** mo≈æemo koristiti odsecanje.<br> 
Tada se sve vrednosti manje od minimalne zadate slikaju u min. Analogno va≈æi za max.

<div style="text-align:left; font-size: 1.em;">
\(\displaystyle
\text{clipping}(x, \min, \max) =
\begin{cases}
\min, & x < \min \\
\max, & x > \max \\
\dfrac{x - \min}{\max - \min}, & \text{inaƒçe}
\end{cases}
\)
</div>

In [33]:
# Mo≈æe se primeniti pre i posle drugih vrsta normalizacije.
def clipping(X, min, max):
    X.where(X > min, min, inplace=True)
    X.where(X < max, max, inplace=True)
    return X

In [40]:
titanic_clip = clipping(titanic['fare'], titanic['age'].min(), titanic['age'].max())
titanic_clip

0      0.42
1      0.42
2      0.42
3      0.42
4      0.42
       ...
886    0.42
887    0.42
888    0.42
889    0.42
890    0.42
Name: fare, Length: 891, dtype: float64

## Logaritamsko skaliranje
Logaritamsko skaliranje je korisno ukoliko ukoliko imamo raspodelu verovatnoƒáe stepenog zakona (Paretova raspodela).

Intuitivno: ako imamo malo tacaka sa velikim vrednostima i dosta tacaka sa malim vrednostima. Npr: raspodela bogatstva u dru≈°tvu, filmske recenzije.

Iz tog razloga koristimo logaritam, da smanjimo razliku izmeƒëu vrednosti.

$x' = \log(x)$

In [41]:
def log(X):
    return np.log(X)

## Z-score (standardizacija)
Z-score predstavlja koliko standardinh devijacija je vrednost udaljena od srednje vrednosti.

Koristimo kada ≈æelimo da osiguramo da je mean = 0 i std = 1. Korisno ako imamo outlajere, ali ne ekstremne da nam treba odsecanje

$x' = \frac{x - \mu}{\sigma}$

Œº = srednja vrednost

œÉ = standardna devijacija

In [43]:
def z_score(X):
    return (X - X.mean()) / X.std()